<template>
  <div class="cssanimation sequence fadeInBottom">
    <p class="mt-8 text-2xl font-bold leading-relaxed text-center">
      ผลการเรียนรู้ PLO หลักสูตรสาขาวิชาวิทยาการคอมพิวเตอร์
    </p>
    <p class="mb-8 text-xl font-bold leading-relaxed text-center">
      คณะวิทยาศาสตร์ มหาวิทยาลัยแม่โจ้
    </p>
    <p class="my-6 rem2 font-semibold">
      ผลลัพธ์การเรียนรู้ที่เฉพาะเจาะจง (Specific Learning Outcomes: SLO)
    </p>

    <p class="my-6 px-4">
      <b>PLO 1</b> : มีความรู้
      ความสามารถทั้งภาคทฤษฎีและภาคปฏิบัติทางวิชาการและเป็นนักปฏิบัติที่เชี่ยวชาญทางด้านวิทยาการคอมพิวเตอร์
    </p>
    <p class="my-6 px-4">
      <b>PLO 2</b> : มีทักษะในการแสวงหาความรู้โดยอิสระ
      และนำไปประยุกต์ใช้งานทางด้านวิทยาการคอมพิวเตอร์
      ได้อย่างถูกต้องและมีประสิทธิภาพ
    </p>
    <p class="my-6 px-4">
      <b>PLO 3</b> : มีทักษะที่สามารถนำไปใช้ในการประกอบอาชีพทั้งภาครัฐ เอกชน
      และเป็นนักเทคโนโลยี ที่สามารถเป็นผู้ประกอบการในอนาคตได้
    </p>
    <p class="my-6 px-4">
      <b>PLO 4</b> : มีความสามารถในเชิงสหวิทยาการทั้งการคิด
      วิเคราะห์และแก้ไขปัญหาอย่างเป็นระบบ
      เพื่อสร้างผลงานวิจัยและนวัตกรรมที่มีคุณภาพ
      โดยมุ่งเน้นด้านการเกษตรหรือเทคโนโลยีในศตวรรษที่ 21
      ทางด้านวิชาวิทยาการคอมพิวเตอร์ ผลลัพธ์การเรียนรู้ทั่วไป (Generic Learning
      Outcomes) ของหลักสูตร
    </p>
    <p class="my-6 px-4">
      <b>PLO 5</b> : มีความเป็นผู้นำ กล้าคิดตัดสินใจโดยใช้เกณฑ์หรือมาตรฐาน
      รู้จักบทบาทและหน้าที่ของตนเองในสังคม
    </p>
    <p class="my-6 px-4">
      <b>PLO 6</b> : มีวินัย เคารพกฎเกณฑ์ขององค์กรและสังคม มีสามารถในการใช้ภาษา
      อีกทั้งสามารถบูรณาการความรู้ที่เพิ่มศักยภาพและขีดสมรรถนะของชุมชน
    </p>
    <p class="my-6 px-4">
      <b>PLO 7</b> : มีคุณธรรม จริยธรรม ศีลธรรมในการครองชีพ
      และมีจรรยาบรรณในวิชาชีพ
    </p>
  </div>
</template>

<script>
export default {};
</script>

<style></style>
